app/controllers/ideas_controller.rb

  def show
    @idea = Idea.find(params[:id])

    respond_to do|format|
      format.html # show.html.erb
      format.json { render json: @idea }

    @comments = @idea.comments.all
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 1]]

  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @idea.update(idea_params)
---
UPDATE "ideas" SET "picture" = ?, "updated_at" = ? WHERE "ideas"."id" = ?